add imports

In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv("../csv/BrusselsAirlines.csv")

In [3]:
df.describe()

,Departure,Destination,Date,Departure time,Arrival time,Stops,Flightnumber,Airports,Duration,Price
count,688,688,688,688,688,688,688,688,688,688
unique,1,11,30,26,71,5,131,31,84,279
top,brussel,napels,01/04/2023,06:55,13:55,1,"['LH 5629', 'LH 1914']","['Brussels Airlines', 'Lufthansa']",455,346.58
freq,688,194,49,192,122,409,30,216,58,32

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 688 entries, 0 to 687
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Departure       688 non-null    object
 1   Destination     688 non-null    object
 2   Date            688 non-null    object
 3   Departure time  688 non-null    object
 4   Arrival time    688 non-null    object
 5   Stops           688 non-null    object
 6   Flightnumber    688 non-null    object
 7   Airports        688 non-null    object
 8   Duration        688 non-null    object
 9   Price           688 non-null    object
dtypes: object(10)
memory usage: 53.9+ KB

In [5]:
df.filter(items=["Departure", "Destination", "Date", "Departure time", "Arrival time", "Stops", "Flightnumber", "Airports", "Duration", "Price"])

,Departure,Destination,Date,Departure time,Arrival time,Stops,Flightnumber,Airports,Duration,Price
0,brussel,heraklion,01/04/2023,05:55,10:20,0,['SN 3255'],['Brussels Airlines'],205,392.14
1,brussel,heraklion,01/04/2023,06:20,14:15,1,"['LX 4551', 'LX 2350']","['Brussels Airlines', 'Swiss International Air...",415,527.84
2,brussel,heraklion,01/04/2023,19:15,08:50,1,"['LH 5589', 'LH 4420']","['Brussels Airlines', 'EW Discover']",755,726.88
3,brussel,heraklion,01/04/2023,19:15,10:00,1,"['OS 8176', 'OS 9003']","['Brussels Airlines', 'Austrian Airlines']",825,718.38
4,brussel,heraklion,01/04/2023,19:15,08:50,1,"['LH 5589', '4Y 1204']","['Brussels Airlines', 'EW Discover']",755,726.88
...,...,...,...,...,...,...,...,...,...,...
683,brussel,palma-de-mallorca,04/04/2023,06:55,14:05,1,"['LH 5629', 'LH 5332']","['Brussels Airlines', 'EUROWINGS EUROPE LTD FO...",430,337.58
684,brussel,tenerife,04/04/2023,13:20,17:00,0,['SN 3781'],['Brussels Airlines'],280,366.14
685,brussel,tenerife,04/04/2023,06:55,16:00,2,"['LH 5629', 'LH 101', 'LH 4380']","['Brussels Airlines', 'Lufthansa', 'EW Discover']",605,795.11
686,brussel,tenerife,04/04/2023,06:55,16:00,2,"['LH 5629', 'LH 99', 'LH 4380']","['Brussels Airlines', 'Lufthansa', 'EW Discover']",605,795.11
687,brussel,tenerife,04/04/2023,15:00,09:55,2,"['LX 4557', 'LX 2819', 'LX 8214']","['Brussels Airlines', 'Swiss International Air...",1195,527.55

In [6]:
df["Departure"].value_counts()

brussel    688
Name: Departure, dtype: int64

In [7]:
df["Destination"].value_counts()

napels               194
palermo              131
heraklion            109
brindisi              83
rhodes                71
malaga                26
palma-de-mallorca     23
faro                  18
ibiza                 14
alicante              10
tenerife               9
Name: Destination, dtype: int64

In [8]:
df["Date"].value_counts()

01/04/2023    49
02/04/2023    44
03/04/2023    40
04/04/2023    40
15/04/2023    25
22/04/2023    24
29/04/2023    24
08/04/2023    23
28/04/2023    22
14/04/2023    21
21/04/2023    21
13/04/2023    20
20/04/2023    20
09/04/2023    20
17/04/2023    20
18/04/2023    20
23/04/2023    19
25/04/2023    19
24/04/2023    19
16/04/2023    19
12/04/2023    19
07/04/2023    19
05/04/2023    19
19/04/2023    18
11/04/2023    18
10/04/2023    18
27/04/2023    18
30/04/2023    18
26/04/2023    17
06/04/2023    15
Name: Date, dtype: int64

In [9]:
df["Departure time"].value_counts()

06:55    192
07:00    100
06:20     93
19:15     75
19:00     70
09:35     42
19:20     33
None      18
05:55     13
15:00     10
06:50      6
16:25      4
07:35      4
07:55      4
13:45      4
09:20      3
11:55      3
17:05      3
06:00      2
13:20      2
09:15      2
14:05      1
15:25      1
17:20      1
14:15      1
08:40      1
Name: Departure time, dtype: int64

In [10]:
df["Arrival time"].value_counts()

13:55    122
12:25     59
22:35     58
11:05     49
12:05     38
        ...
13:50      1
13:40      1
15:35      1
14:40      1
13:25      1
Name: Arrival time, Length: 71, dtype: int64

In [11]:
df["Stops"].value_counts()

1       409
2       180
0        67
None     18
3        14
Name: Stops, dtype: int64

In [12]:
df["Flightnumber"].value_counts()

['LH 5629', 'LH 1914']               30
['LX 4551', 'LX 2807', 'LX 1722']    29
['SN 3169']                          29
['LH 5631', 'LH 1880']               29
['SN 2647', 'SN 7181']               29
                                     ..
['LH 5629', 'LH 1796']                1
['LH 5629', 'LH 5334']                1
['LH 5629', 'LH 1838']                1
['LX 4551', 'LX 2807', 'LX 8216']     1
['LH 5629', 'LH 99', 'LH 4380']       1
Name: Flightnumber, Length: 131, dtype: int64

In [13]:
df["Airports"].value_counts()

['Brussels Airlines', 'Lufthansa']                                                          216
['Brussels Airlines', 'EW Discover']                                                         87
['Brussels Airlines']                                                                        67
['Brussels Airlines', 'Swiss International Air Lines', 'Swiss International Air Lines']      42
['Brussels Airlines', 'Swiss International Air Lines']                                       36
['Brussels Airlines', 'Lufthansa', 'EW Discover']                                            29
['Brussels Airlines', 'Lufthansa', 'Lufthansa']                                              27
['Brussels Airlines', 'Swiss International Air Lines', 'Air Baltic']                         26
['Brussels Airlines', 'Austrian Airlines']                                                   22
None                                                                                         18
['Brussels Airlines', 'Swiss International Air Lines', 'Edelweiss Air']                      16
['Brussels Airlines', 'Air Baltic']                                                          13
['Brussels Airlines', 'Swiss International Air Lines', 'Edelweiss Air', 'Edelweiss Air']     12
['Brussels Airlines', 'SWISS RAILWAYS', 'Air Baltic']                                        11
['Brussels Airlines', 'Edelweiss Air']                                                       10
['Brussels Airlines', 'Aegean Airlines']                                                      9
['Brussels Airlines', 'SWISS RAILWAYS', 'Swiss International Air Lines']                      6
['Brussels Airlines', 'Swiss International Air Lines', 'Helvetic Airways']                    6
['Brussels Airlines', 'SWISS RAILWAYS', 'Helvetic Airways']                                   6
['Brussels Airlines', 'Tap Air Portugal']                                                     5
['Brussels Airlines', 'Eurowings']                                                            4
['Brussels Airlines', 'Lufthansa', 'Aegean Airlines']                                         4
['Brussels Airlines', 'EUROWINGS EUROPE LTD FOR EUROWINGS']                                   3
['Brussels Airlines', 'Edelweiss Air', 'Edelweiss Air']                                       3
['Brussels Airlines', 'SWISS RAILWAYS', 'Edelweiss Air', 'Edelweiss Air']                     2
['Brussels Airlines', 'SWISS RAILWAYS', 'Edelweiss Air']                                      2
['Brussels Airlines', 'Helvetic Airways']                                                     2
['Brussels Airlines', 'Lufthansa Cityline']                                                   1
['Brussels Airlines', 'Lufthansa', 'Lufthansa Cityline']                                      1
['Brussels Airlines', 'Lufthansa', 'Tap Air Portugal']                                        1
['Brussels Airlines', 'AVION EXPRESS MALTA FOR EUROWINGS']                                    1
Name: Airports, dtype: int64

In [14]:
df["Duration"].value_counts()

455     58
215     58
330     54
420     42
305     39
        ..
135      1
160      1
825      1
595      1
1195     1
Name: Duration, Length: 84, dtype: int64

In [15]:
df["Price"].value_counts()

346.58    32
184.58    21
149.58    21
None      18
275.58    15
          ..
349.67     1
673.67     1
609.38     1
556.05     1
527.55     1
Name: Price, Length: 279, dtype: int64